
#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	МассивТестов = Новый Массив;
	
	МассивТестов.Добавить("ТестДолжен_ПрочитатьКонфигурацию");
	
	Возврат МассивТестов;
	
КонецФункции

Процедура ТестДолжен_ПрочитатьКонфигурацию() Экспорт
	
	Конфиг = Новый КонфигурацияПриложения(ОбъединитьПути(ТекущийСценарий().Каталог, "config.json"));
	
	База1 = Конфиг.ПолучитьБазу("base1");
	База2 = Конфиг.ПолучитьБазу("base2");
	База3 = Конфиг.ПолучитьБазу("base3");
	База4 = Конфиг.ПолучитьБазу("base4");
	
	Параметр1 = Конфиг.ПолучитьПараметр("p1");
	Параметр2 = Конфиг.ПолучитьПараметр("p2");
	Параметр3 = Конфиг.ПолучитьПараметр("p3");
	Параметр4 = Конфиг.ПолучитьПараметр("p4");
	Параметр5 = Конфиг.ПолучитьПараметр("p5");
	
	Ожидаем
		.Что(База1).ИмеетТип("ОписаниеБазы")
		.Что(База1.СтрокаПодключения).Равно("File='C:\base1'")
		.Что(База1.Пользователь).Равно("Администратор")
		.Что(База1.Пароль).Равно("123")
		.Что(База1.ВерсияПлатформы).Равно("8.3")
		.Что(База1.ЭтоФайловаяБаза()).ЕстьИстина()
		
		.Что(База2).ИмеетТип("ОписаниеБазы")
		.Что(База2.СтрокаПодключения).Равно("File='C:\base2'")
		.Что(База2.Пользователь).ЕстьНеопределено()
		.Что(База2.Пароль).ЕстьНеопределено()
		.Что(База2.ВерсияПлатформы).Равно("8.3")
		
		.Что(База3).ИмеетТип("ОписаниеБазы")
		.Что(База3.СтрокаПодключения).Равно("Srvr='srvr';Ref='base3'")
		.Что(База3.Пользователь).Равно("Администратор")
		.Что(База3.Пароль).Равно("123")
		.Что(База3.ВерсияПлатформы).Равно("8.3.10")
		.Что(База3.ЭтоФайловаяБаза()).ЕстьЛожь()
		
		.Что(База4).ЕстьНеопределено()
		
		.Что(Параметр1).Равно("param1")
		.Что(Параметр2).ЕстьИстина()
		.Что(Параметр3).ЕстьЛожь()
		.Что(Параметр4).Равно(10)
		.Что(Параметр5).ЕстьНеопределено();
		
КонецПроцедуры
